# Get our taps
tap "garethr/kubeval"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "johanhaleby/kubetail"
tap "mveritym/mel"

# command line tools
brew "ack"
brew "awscli"
brew "bash"
brew "cmake"
brew "coreutils"
brew "curl"
brew "garethr/kubeval/kubeval"
brew "gcc"
brew "git"
brew "goenv"
brew "gnupg"
brew "johanhaleby/kubetail/kubetail"
brew "kops"
brew "kube-ps1"
brew "kubectx"
brew "kubernetes-helm"
brew "kustomize"
brew "libpq"
brew "mas"
brew "mveritym/mel/kubedecode"
brew "mysql-client"
brew "neovim"
brew "nodenv"
brew "python"
brew "python@2"
brew "rbenv"
brew "tig"
brew "watch"
brew "wget"
brew "zsh"

# GUI/Binary Apps
cask "adobe-acrobat-reader"
cask "atom"
cask "balenaetcher"
cask "daisydisk"
cask "docker"
cask "firefox"
cask "forklift"
cask "font-firacode-nerd-font-mono"
cask "google-chrome"
cask "google-drive-file-stream"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "logitech-options"
cask "microsoft-office"
cask "ngrok"
cask "parsec"
cask "plex-media-player"
cask "postico"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "sdformatter"
cask "sequel-pro"
cask "spectacle"
cask "teamviewer"
cask "tunnelblick"
cask "vlc"
cask "vnc-viewer"
cask "webpquicklook"

# Mac App Store
mas "LastPass", id: 926036361
mas "Microsoft Remote Desktop", id: 1295203466
mas "Slack", id: 803453959
mas "SonicWall Mobile Connect", id: 822514576
mas "Unsplash Wallpapers", id: 1284863847
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
