tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "instrumenta/instrumenta"
tap "johanhaleby/kubetail"
tap "mveritym/mel"
tap "weaveworks/tap"
brew "ack"
brew "coreutils"
brew "python@3.9"
brew "awscli"
brew "bash"
brew "circleci"
brew "cmake"
brew "curl"
brew "fzf"
brew "gh"
brew "git"
brew "pkg-config"
brew "pinentry"
brew "gnupg"
brew "go"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "libpq"
brew "mackup"
brew "mas"
brew "mysql-client@5.7"
brew "neovim"
brew "node"
brew "pinentry-mac"
brew "ruby"
brew "sops"
brew "telnet"
brew "tig"
brew "unzip"
brew "watch"
brew "wget"
brew "z"
brew "zsh"
brew "fluxcd/tap/flux"
brew "johanhaleby/kubetail/kubetail"
brew "mveritym/mel/kubedecode"
brew "weaveworks/tap/eksctl"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "forklift"
cask "google-chrome"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "logitech-options"
cask "private-internet-access"
cask "rectangle"
cask "tableplus"
cask "visual-studio-code"
cask "vnc-viewer"
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Parcel", id: 639968404
mas "Reolink Client", id: 1086871235
mas "Slack", id: 803453959
mas "SonicWall Mobile Connect", id: 822514576
mas "WireGuard", id: 1451685025
