tap "drone/drone"
tap "garethr/kubeval"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "johanhaleby/kubetail"
tap "mveritym/mel"
tap "weaveworks/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Freely available high-quality data compressor
brew "bzip2"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Manage compile and link flags for libraries
brew "pkg-config"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tool to access Weave Flux, the Kubernetes GitOps operator
brew "fluxctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Postgres C API library
brew "libpq"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Text interface for Git repositories
brew "tig"
# Extraction utility for .zip compressed archives
brew "unzip"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
brew "drone/drone/drone"
# Validate your Kubernetes configurations
brew "garethr/kubeval/kubeval"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail"
# Decode all parts of a kubernetes secret, no more copypasting!
brew "mveritym/mel/kubedecode"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
cask "authy"
cask "balenaetcher"
cask "calibre"
cask "daisydisk"
cask "discord"
cask "docker"
cask "firefox"
cask "forklift"
cask "google-chrome"
cask "google-drive-file-stream"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "keepassxc"
cask "lastpass"
cask "logitech-camera-settings"
cask "logitech-options"
cask "openvpn-connect"
cask "parsec"
cask "plex"
cask "private-internet-access"
cask "rectangle"
cask "steam"
cask "tableplus"
cask "teamviewer"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "zoomus"
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Cashrewards", id: 1449226880
mas "Debit & Credit", id: 882637653
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Parcel", id: 639968404
mas "Qantas", id: 1468230799
mas "Slack", id: 803453959
mas "SonicWall Mobile Connect", id: 822514576
mas "WhatsApp", id: 1147396723
