authy
balenaetcher
calibre
daisydisk
docker
firefox
forklift
google-chrome
google-drive
insomnia
istat-menus
iterm2
keepassxc
lastpass
logitech-camera-settings
logitech-options
openvpn-connect
parsec
plex
private-internet-access
rectangle
steam
tableplus
teamviewer
visual-studio-code
vlc
vnc-viewer
zoom
